cryham/stm32-clock/Src/def.c
#include "stm32f1xx_hal.h"


GPIO_TypeDef* Ports[4] = {GPIOA, GPIOB, GPIOC, GPIOD};


//  LEDs  yellow,green  port,pin
const uint
	YlwPo = 1, YlwPi = 14,
	GrnPo = 1, GrnPi = 13;

//  dot matrix  digit, column
	Port[4][5] = {{1,1,1,1,1},{1,1, 0, 0, 0}, {0,0,0,0,0},{0,0,0,1,1}},
	Pin [4][5] = {{9,8,7,6,5},{4,3,15,12,11}, {0,1,2,3,4},{5,6,7,0,1}},
//  rows shifter 4094
	RowDPo = 2, RowDPi = 13,  // data
	RowClkPo = 2, RowClkPi = 14,  // clk

//  keys
	KPort[4] = { 0,1, 0,0},
	KPin [4] = {10,15,9,8};


//  Digits 5x7 font
const char Digits[10][7] = {
{0b01110, // 0
 0b10001,
 0b10001,
 0b10001,
 0b10001,
 0b10001,
 0b01110},
{0b00100, // 1
 0b01100,
 0b10100,
 0b00100,
 0b00100,
 0b00100,
 0b01110},
{0b01110, // 2
 0b10001,
 0b00001,
 0b00010,
 0b00100,
 0b01000,
 0b11111},
{0b01110, // 3
 0b10001,
 0b00001,
 0b00110,
 0b00001,
 0b10001,
 0b01110},
{0b00001, // 4
 0b00011,
 0b00101,
 0b01001,
 0b11111,
 0b00001,
 0b00001},
{0b11111, // 5
 0b10000,
 0b10000,
 0b11110,
 0b00001,
 0b00001,
 0b11110},
{0b00110, // 6
 0b01000,
 0b10000,
 0b11110,
 0b10001,
 0b10001,
 0b01110},
{0b11111, // 7
 0b00001,
 0b00010,
 0b00010,
 0b00100,
 0b00100,
 0b01000},
{0b01110, // 8
 0b10001,
 0b10001,
 0b01110,
 0b10001,
 0b10001,
 0b01110},
{0b01110, // 9
 0b10001,
 0b10001,
 0b01111,
 0b00001,
 0b00010,
 0b01100},
};
